Tekla Open API Reference for Tekla Structures 2025
Localization.LoadXMLFile Method
 Loads the localization strings from an xml file. Several files may be used concurrently, just call LoadXMLFile for each file. The translations are searched in the loading order and the first match is returned.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void LoadXMLFile(
	string fileName
)
Public Sub LoadXMLFile (
	fileName As String
)
Parameters
fileName
Type: System.String
The xml file to be loaded.
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace